app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "kolo"], ["price", 20], ["created_at", "2019-05-26 08:24:39.479200"], ["updated_at", "2019-05-26 08:24:39.479200"], ["inventory", 8], ["description", "sfsfas"]]